IoTThinks/esp32FOTAGSM/src/esp32fotagsm.cpp
/*
   esp32 firmware OTA
   Date: December 2018
   Purpose: Perform an OTA update from a bin located on a webserver (HTTP Only)
*/

#include "esp32fotagsm.h"
#include "Arduino.h"
#include <Update.h>
#include "ArduinoJson.h"
#include "esp_log.h"

#define CLIENT_TIMEOUT_MS (120000)
#define DOWNLOAD_CHUNK_SIZE (16380)//(8192)

esp32FOTAGSM::esp32FOTAGSM(Client &client, 
                            String firwmareType, int firwmareVersion,
                            TConnectionCheckFunction connectionCheckFunction,
                            SemaphoreHandle_t networkSemaphore,
                            int ledPin,
                            uint8_t ledOn,
                            bool chunkedDownload)
                            :
                            _ledPin(ledPin),
                            _ledOn(ledOn),
                            _chunkedDownload(chunkedDownload)
{
    this->setClient(client);
    this->setConnectionCheckFunction(connectionCheckFunction);
    this->setNetworkSemaphore(networkSemaphore);
    useDeviceID = false;
}

bool esp32FOTAGSM::_checkConnection()
{
    if (_connectionCheckFunction != NULL)
    {
        return _connectionCheckFunction();
    }else{
        ESP_LOGD(TAG, "No connection check function defined");
        return true;
    }
}

void esp32FOTAGSM::_blockingNetworkSemaphoreTake()
{
    if (_networkSemaphore != NULL)
    {
        ESP_LOGD(TAG, "Taking network semaphore (blocking)");
        xSemaphoreTake(_networkSemaphore, portMAX_DELAY);
    }else{
        ESP_LOGD(TAG, "No network semaphore");
    }
}

void esp32FOTAGSM::_blockingNetworkSemaphoreGive()
{
    if (_networkSemaphore != NULL)
    {
        ESP_LOGD(TAG, "Giving network semaphore");
        xSemaphoreGive(_networkSemaphore);
    }else{
        ESP_LOGD(TAG, "No network semaphore");
    }
}

static void splitHeader(String src, String &header, String &headerValue)
{
    int idx = 0;

    idx = src.indexOf(':');
    header = src.substring(0, idx);
    headerValue = src.substring(idx + 1, src.length());
    headerValue.trim();

    return;
}

// OTA Logic
bool esp32FOTAGSM::execOTA()
{
    unsigned long timeout = 0;
    int contentLength = 0;
    bool isValidContentType = false;
    bool Accept_Ranges_bytes = false;
    bool gotHTTPStatus = false;

    size_t total_written_bytes = 0;
    size_t last_written_bytes = 0;

    ESP_LOGD(TAG, "Connecting to: %S", _host.c_str());

    _client->setTimeout(CLIENT_TIMEOUT_MS);
    ESP_LOGD(TAG, "timeout set to: %d", CLIENT_TIMEOUT_MS);

    // Connect to Webserver
    if (_client->connect(_host.c_str(), _port))
    {

        // Connection Succeed.
        // Fetching the bin HEAD
        ESP_LOGD(TAG, "Fetching Bin HEAD: %s", _bin.c_str());

        // Get the contents of the bin file
        _client->print(String("HEAD ") + _bin + " HTTP/1.1\r\n" +
                       "Host: " + _host + "\r\n" +
                       "Cache-Control: no-cache\r\n" +
                       "Connection: close\r\n\r\n");

        timeout = millis();
        while (_client->available() == 0)
        {
            if (millis() - timeout > CLIENT_TIMEOUT_MS)
            {
                ESP_LOGD(TAG, "Client Timeout !");
                _client->stop();
                return false;
            }
        }

        while (_client->available())
        {
            String header, headerValue;
            // read line till /n
            String line = _client->readStringUntil('\n');

            ESP_LOGD(TAG, "Header line: %s", line.c_str());

            // remove space, to check if the line is end of headers
            line.trim();

            if (!line.length())
            {
                //headers ended
                break; // and get the OTA started
            }

            // Check if the HTTP Response is 200
            // else break and Exit Update
            if (line.startsWith("HTTP/1.1"))
            {
                if (line.indexOf("200") < 0)
                {
                    ESP_LOGE(TAG, "Got a non 200 status code from server. Exiting OTA Update.");
                    _client->stop();
                    break;
                }
                gotHTTPStatus = true;
            }

            if (false == gotHTTPStatus)
            {
                continue;
            }

            splitHeader(line, header, headerValue);

            // extract headers here
            // Content-Length
            if (header.equalsIgnoreCase("Content-Length"))
            {
                contentLength = headerValue.toInt();
                ESP_LOGD(TAG, "Content-Length: %d", contentLength);
            }
            // Content-type
            else if (header.equalsIgnoreCase("Content-type"))
            {
                String contentType = headerValue;
                ESP_LOGD(TAG, "Content-type: %s", contentType.c_str());
                if (contentType == "application/octet-stream")
                {
                    ESP_LOGD(TAG, "Valid Content-type");
                    isValidContentType = true;
                }
            }
            // Accept-Ranges
            else if (header.equalsIgnoreCase("Accept-Ranges"))
            {
                String contentType = headerValue;
                ESP_LOGD(TAG, "Accept-Ranges: %s", contentType.c_str());
                if (contentType == "bytes")
                {
                    ESP_LOGD(TAG, "Server supports range requests");
                    Accept_Ranges_bytes = true;
                }
            }
        }
    }
    else
    {
        ESP_LOGD(TAG, "Connection to %s failed!", _host.c_str());
        return false;
    }

    // We will open a new connection to the server later
    _client->stop();

    // check contentLength and content type
    if (contentLength && isValidContentType)
    {

        // Check if there is enough to OTA Update.
        if (Update.begin(contentLength))
        {
            ESP_LOGD(TAG, "OTA file can be downloaded.");

            // Setup Update onProgress callback
            Update.onProgress(
                [](unsigned int progress, unsigned int total)
                {
                    ESP_LOGI(TAG, "Update Progress: %u of %u", progress, total);
                });

            if (Accept_Ranges_bytes)
            {
                ESP_LOGD(TAG, "OTA file will be downloaded in chunks");

                // Number of chunks
                int numChunks = contentLength / DOWNLOAD_CHUNK_SIZE;
                if (contentLength % DOWNLOAD_CHUNK_SIZE)
                {
                    numChunks++;
                }

                uint chunk_first_byte = 0;
                uint chunk_last_byte = DOWNLOAD_CHUNK_SIZE - 1;
                uint remainig_bytes = contentLength;
                uint8_t chunk_buffer[DOWNLOAD_CHUNK_SIZE + 1];
                bool should_close_connection = false;

                while (remainig_bytes > 0)
                {
                    if (!_checkConnection())
                    {
                        ESP_LOGE(TAG, "Connection lost. Retrying in 5 seconds");
                        delay(5000);
                        continue;
                    }

                    _blockingNetworkSemaphoreTake();

                    // check if the connection is still alive
                    if (!_client->connected())
                    {
                        ESP_LOGE(TAG, "Client Disconnected");

