IoTThinks/esp32FOTAGSM/src/esp32fotagsm.cpp
                        // Connect to Webserver
                        if (_client->connect(_host.c_str(), _port))
                        {
                            ESP_LOGD(TAG, "client connected");
                            _blockingNetworkSemaphoreGive();
                        }
                        else
                        {
                            ESP_LOGD(TAG, "Connection to %s failed! Retrying in 5 seconds", _host.c_str());
                            _blockingNetworkSemaphoreGive();
                            delay(5000);
                            continue;
                        }
                    }
                    else
                    {

                        if (remainig_bytes < DOWNLOAD_CHUNK_SIZE)
                        {
                            ESP_LOGW(TAG, "Last chunk of %d bytes", remainig_bytes);
                            chunk_last_byte = chunk_first_byte + remainig_bytes - 1;
                        }

                        if( chunk_last_byte - chunk_first_byte > DOWNLOAD_CHUNK_SIZE)
                        {
                            ESP_LOGW(TAG, "Chunk size is too big, adjust to DOWNLOAD_CHUNK_SIZE");
                            chunk_last_byte = chunk_first_byte + DOWNLOAD_CHUNK_SIZE - 1;
                        }

                        ESP_LOGD(TAG, "Downloading a chunk from bytes %u to %u, remaining bytes: %u", chunk_first_byte, chunk_last_byte, remainig_bytes);

                        _client->flush();
                        // Get the contents of the bin file
                        _client->print(String("GET ") + _bin + " HTTP/1.1\r\n" +
                                       "Host: " + _host + "\r\n" +
                                       "Cache-Control: no-cache\r\n" +
                                       "Range: bytes=" + String(chunk_first_byte) + "-" + String(chunk_last_byte) + "\r\n" +
                                       "Connection: keep-alive\r\n\r\n");

                        timeout = millis();
                        while (_client->available() == 0)
                        {
                            if (millis() - timeout > CLIENT_TIMEOUT_MS)
                            {
                                ESP_LOGD(TAG, "Client Timeout!");
                                _client->stop();
                                return false;
                            }
                        }

                        // Read the headers
                        while (_client->available())
                        {
                            String header, headerValue;
                            // read line till /n
                            String line = _client->readStringUntil('\n');

                            // ESP_LOGV(TAG, "Header line: %s", line.c_str());

                            // remove space, to check if the line is end of headers
                            line.trim();

                            if (!line.length())
                            {
                                ESP_LOGV(TAG, "Headers ended. Get the payload");
                                break;
                            }
                            // Check if the HTTP Response is 206
                            // else break and Exit Update
                            if (line.startsWith("HTTP/1.1"))
                            {
                                if (line.indexOf("206") < 0)
                                {
                                    ESP_LOGE(TAG, "Got a non 206 status code from server. Exiting OTA Update.");
                                    // @TODO: check exit code
                                    _client->stop();
                                    break;
                                }
                            }

                            splitHeader(line, header, headerValue);

                            // extract headers here
                            // Connection
                            if (header.equalsIgnoreCase("Connection"))
                            {
                                if (headerValue == "keep-alive")
                                {
                                    ESP_LOGD(TAG, "Server will keep the connection alive");
                                    should_close_connection = false;
                                }
                                else
                                {
                                    ESP_LOGD(TAG, "Server will close the connection");
                                    should_close_connection = true;
                                }
                            }
                            // Content-Range
                            else if (header.equalsIgnoreCase("Content-Range"))
                            {
                                ESP_LOGD(TAG, "Content-Range: %s", headerValue.c_str());
                                // @TODO: check if the content range is valid
                            }
                        }

                        uint bytes_to_read = chunk_last_byte - chunk_first_byte + 1;

                        // Read the payload
                        size_t readed_bytes = _client->readBytes(chunk_buffer, bytes_to_read);
                        ESP_LOGD(TAG, "Readed %u bytes from payload", readed_bytes);

                        // Check if the readed bytes are same as the expected bytes
                        if (readed_bytes != bytes_to_read)
                        {
                            ESP_LOGE(TAG, "Expected %u bytes but got %u", bytes_to_read, readed_bytes);
                            
                            // We readed less than expected, so we update the chunk_last_byte acordingly
                            chunk_last_byte = chunk_first_byte + readed_bytes - 1;
                        }

                        // Write chunk to flash
                        last_written_bytes = Update.write(chunk_buffer, readed_bytes);
                        total_written_bytes += last_written_bytes;

                        // Check if the written bytes are same as the expected bytes
                        if (last_written_bytes != readed_bytes)
                        {
                            ESP_LOGE(TAG, "Expected to write %u bytes but %u were written", readed_bytes, total_written_bytes);
                        }else{
                            ESP_LOGD(TAG, "Written %u bytes to flash", total_written_bytes);
                        }

                        chunk_first_byte += last_written_bytes;
                        chunk_last_byte += last_written_bytes;
                        remainig_bytes -= last_written_bytes;

                        ESP_LOGD(TAG, "next chunk from bytes %u to %u, remaining bytes: %u", chunk_first_byte, chunk_last_byte, remainig_bytes);

