IoTThinks/esp32FOTAGSM/src/esp32fotagsm.cpp
                        if (should_close_connection)
                        {
                            ESP_LOGD(TAG, "Server will close the connection, so we will stop the client to reconnect again later");
                            _client->stop();
                            delay(1000);
                        }
                        _blockingNetworkSemaphoreGive();
                        delay(250); //give some time for other threads to take the semaphore
                    }
                }
            }
            else
            {
                ESP_LOGD(TAG, "OTA file will be downloaded in one go");
                _client->flush();

                // Connect to Webserver
                if (_client->connect(_host.c_str(), _port))
                {
                    // Get the contents of the bin file
                    _client->print(String("GET ") + _bin + " HTTP/1.1\r\n" +
                                   "Host: " + _host + "\r\n" +
                                   "Cache-Control: no-cache\r\n" +
                                   "Connection: close\r\n\r\n");

                    timeout = millis();
                    while (_client->available() == 0)
                    {
                        if (millis() - timeout > CLIENT_TIMEOUT_MS)
                        {
                            ESP_LOGD(TAG, "Client Timeout !");
                            _client->stop();
                            return false;
                        }
                    }
                    while (_client->available())
                    {
                        String header, headerValue;
                        // read line till /n
                        String line = _client->readStringUntil('\n');

                        ESP_LOGD(TAG, "Header line: %s", line.c_str());

                        // remove space, to check if the line is end of headers
                        line.trim();

                        if (!line.length())
                        {
                            ESP_LOGD(TAG, "Headers ended. Get the OTA started");
                            break;
                        }
                    }

                    ESP_LOGD(TAG, "Begin OTA. This may take several minutes to complete. Patience!");
                    total_written_bytes = Update.writeStream(*_client);
                }
                else
                {
                    ESP_LOGD(TAG, "Connection to %s failed!", _host.c_str());
                    return false;
                }
            }

            if (total_written_bytes == contentLength)
            {
                ESP_LOGD(TAG, "Written: %d successfully", total_written_bytes);
            }
            else
            {
                ESP_LOGD(TAG, "Written only : %d of %d. OTA will not proceed. ", total_written_bytes, contentLength);
            }

            if (Update.end())
            {
                ESP_LOGD(TAG, "OTA done!");
                if (Update.isFinished())
                {
                    ESP_LOGD(TAG, "Update successfully completed. Rebooting.");
                    while (1)
                    {
                        /* code */
                    }
                    
                    ESP.restart();
                }
                else
                {
                    ESP_LOGD(TAG, "Update not finished? Something went wrong!");
                }
            }
            else
            {
                ESP_LOGD(TAG, "Error Occurred. Error #%d: %s", Update.getError(), Update.errorString());
            }
        }
        else
        {
            // not enough space to begin OTA
            // Understand the partitions and
            // space availability
            ESP_LOGE(TAG, "Not enough space to begin OTA");
            _client->flush();

            return false;
        }
    }
    else
    {
        ESP_LOGE(TAG, "There was no content in the response or the content type was not application/octet-stream");
        _client->flush();

        return false;
    }
}

bool esp32FOTAGSM::execHTTPcheck()
{
    int contentLength = 0;
    bool isValidContentType = false;
    bool gotHTTPStatus = false;

    String useURL;

    if (useDeviceID)
    {
        useURL = checkRESOURCE + "?id=" + _getDeviceID();
    }
    else
    {
        useURL = checkRESOURCE;
    }

    _port = 80;

    ESP_LOGD(TAG, "Getting %s", useURL.c_str());

    //current connection status should be checked before calling this function

    _client->setTimeout(CLIENT_TIMEOUT_MS);

    if (_client->connect(checkHOST.c_str(), checkPORT))
    {
        // Connection Succeed.

        // Get the contents of the bin file
        _client->print(String("GET ") + checkRESOURCE + " HTTP/1.1\r\n" +
                       "Host: " + checkHOST + "\r\n" +
                       "Cache-Control: no-cache\r\n" +
                       "Connection: close\r\n\r\n");

        unsigned long timeout = millis();
        while (_client->available() == 0)
        {
            if (millis() - timeout > CLIENT_TIMEOUT_MS)
            {
                ESP_LOGD(TAG, "Client Timeout !");
                _client->stop();
                return false;
            }
        }

        while (_client->available())
        {
            String header, headerValue;
            // read line till /n
            String line = _client->readStringUntil('\n');

            ESP_LOGD(TAG, "Header line: %s", line.c_str());

            // remove space, to check if the line is end of headers
            line.trim();

            if (!line.length())
            {
                //headers ended
                break; // and get the OTA started
            }

            // Check if the HTTP Response is 200
            // else break and Exit Update
            if (line.startsWith("HTTP/1.1"))
            {
                if (line.indexOf("200") < 0)
                {
                    ESP_LOGD(TAG, "Got a non 200 status code from server. Exiting OTA Update.");
                    _client->stop();
                    break;
                }
                gotHTTPStatus = true;
            }

            if (false == gotHTTPStatus)
            {
                continue;
            }

