IoTThinks/esp32FOTAGSM/src/esp32fotagsm.cpp
            splitHeader(line, header, headerValue);

            // extract headers here
            // Start with content length
            if (header.equalsIgnoreCase("Content-Length"))
            {
                contentLength = headerValue.toInt();
                ESP_LOGD(TAG, "Content-Length: %d", contentLength);
                continue;
            }

            // Next, the content type
            if (header.equalsIgnoreCase("Content-type"))
            {
                String contentType = headerValue;
                ESP_LOGD(TAG, "Content-type: %s", contentType.c_str());
                if (contentType == "application/json")
                {
                    ESP_LOGD(TAG, "Valid Content-type");
                    isValidContentType = true;
                }
            }
        }

        // check if the contectLength is bigger than the buffer size
        if (contentLength > 256)
        {
            ESP_LOGD(TAG, "contentLength is bigger than 256 bytes. Exiting Update check.");
            return false;
        }

        // check contentLength and content type
        if (contentLength && isValidContentType)
        {
            char JSONMessage[256];
            _client->readBytes(JSONMessage, contentLength);

            StaticJsonDocument<300> JSONDocument; //Memory pool
            DeserializationError err = deserializeJson(JSONDocument, JSONMessage);

            if (err)
            { //Check for errors in parsing
                ESP_LOGD(TAG, "Parsing failed");
                delay(5000);
                return false;
            }

            const char *pltype = JSONDocument["type"];
            int plversion = JSONDocument["version"];
            const char *plhost = JSONDocument["host"];
            _port = JSONDocument["port"];
            const char *plbin = JSONDocument["bin"];

            String jshost(plhost);
            String jsbin(plbin);
            String fwtype(pltype);

            _host = jshost;
            _bin = jsbin;

            ESP_LOGD(TAG, "Host: %s", plhost);
            ESP_LOGD(TAG, "bin: %s", plbin);
            ESP_LOGD(TAG, "type %s", pltype);

            if (plversion > _firwmareVersion && fwtype == _firwmareType)
            {
                return true;
            }
            else
            {
                return false;
            }
        }
        else
        {
            ESP_LOGD(TAG, "There was no content in the response");
            _client->flush();
        }
    }
    else
    {
        // Connect to webserver failed
        ESP_LOGD(TAG, "Connection to %s failed.", checkHOST.c_str());
        return false;
    }
}

String esp32FOTAGSM::_getDeviceID()
{
    char deviceid[21];
    uint64_t chipid;
    chipid = ESP.getEfuseMac();
    sprintf(deviceid, "%" PRIu64, chipid);
    String thisID(deviceid);
    return thisID;
}

// Force a firmware update regartless on current version
void esp32FOTAGSM::forceUpdate(String firmwareHost, int firmwarePort, String firmwarePath)
{
    _host = firmwareHost;
    _bin = firmwarePath;
    _port = firmwarePort;
    execOTA();
}

void esp32FOTAGSM::setClient(Client &client)
{
    this->_client = &client;
}

// set connection check function
void esp32FOTAGSM::setConnectionCheckFunction(TConnectionCheckFunction connectionCheckFunction)
{
    this->_connectionCheckFunction = connectionCheckFunction;
}

void esp32FOTAGSM::setNetworkSemaphore(SemaphoreHandle_t networkSemaphore)
{
    this->_networkSemaphore = networkSemaphore;
}

